Autodesk.Revit.DB.ViewSheetSet.Views
The views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed due to invalid view which cannot be printed.

Autodesk.Revit.DB.ViewSheetSet.Name
The view sheet set name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when trying to set the name. Instead, set the name with the Autodesk.Revit.DB.PrintSetup.Rename(System.String) method.

Autodesk.Revit.DB.ViewSheetSet
Represents ViewSheetSets stored in a document.
ViewSheetSets can be stored so that the same printing task can be executed multiple times.
Remarks: For the in-session ViewSheetSet, see the class InSessionViewSheetSet.